tap "dapr/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/cask-fonts"
tap "buildpacks/tap"

# build tools
brew "automake"
brew "autoconf"
brew "autoconf-archive"
brew "pkg-config"
brew "cmake"
brew "libtool"

# utils
brew "bat"
brew "zsh"
brew "tmux"
brew "neovim"
brew "jq"
brew "yq"
brew "tree"
brew "htop"
brew "fzf"
brew "watch"
brew "ripgrep"
brew "the_silver_searcher"
brew "git"
brew "gnupg"
brew "coreutils"
brew "gh"
brew "mkdocs"
brew "telnet"

# internet
brew "youtube-dl"
brew "wget"
brew "axel"
brew "curl"
brew "speedtest-cli"

# programming/sdks
brew "python3"
brew "ruby"
brew "go"
brew "node"
brew "yarn"
brew "openjdk"
brew "rustup"
cask "dotnet-sdk"

# container/devops"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "docker-credential-helper-ecr"
brew "buildkit"
brew "kubectl"
brew "kubectx"
brew "helm"
brew "kind"
brew "terraform"
brew "pulumi"
brew "vault"
brew "packer"
brew "pack"
cask "google-cloud-sdk"

# virtualization
cask "vagrant"
brew "qemu"

# font
cask "font-jetbrains-mono"
