# core packages always needed regardless of development environment.
#
# for more packages, create ~/.config/brew/packages.rb.
# a template exists at ~/.config/brew/packages.sample.rb

# check if a program exists in PATH
def in_path?(command)
    system("which #{ command} > /dev/null 2>&1")
end

# shell
brew "bat" unless in_path? "bat"
brew "tmux" unless in_path? "tmux"
brew "neovim" unless in_path? "nvim"
brew "tree" unless in_path? "tree"
brew "stow" unless in_path? "stow"
brew "zsh" unless in_path? "zsh"

# utils
brew "jq" unless in_path? "jq"
brew "yq" unless in_path? "yq"
brew "tree" unless in_path? "tree"
brew "htop" unless in_path? "htop"
brew "btop" unless in_path? "btop"
brew "fzf" unless in_path? "fzf"
brew "watch" unless in_path? "watch"
brew "ripgrep" unless in_path? "rg"
brew "the_silver_searcher" unless in_path? "ag"
brew "git" unless in_path? "git"
brew "git-delta" unless in_path? "delta"
brew "socat" unless in_path? "socat"

# internet
brew "curl" unless in_path? "curl"

# load extra packages if exists
packages_file = File.join(ENV["HOME"], ".config/brew/packages.rb")
if File.exist? packages_file
    p = File.open(packages_file, 'r').read
    eval(p)
end

# oh-my-zsh
unless system("(cd ~/.oh-my-zsh && git status) > /dev/null 2>&1")
    system("git clone https://github.com/ohmyzsh/ohmyzsh --depth=1 ~/.oh-my-zsh")
end

